In [2]:
# Importer la biblioth√®que pandas avec l'alias pd
import pandas as pd

In [13]:
# Load the dataset :
df = pd.read_csv("Data/datacamp_workspace_export_2023-07-01 18_19_07.csv")

In [14]:
# determine the size of the  DataFrame (number of rows and columns ) : 
df.shape

(100, 5)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   caldate         100 non-null    object
 1   eventname       100 non-null    object
 2   catgroup        100 non-null    object
 3   priceperticket  100 non-null    int64
 4   qtysold         100 non-null    int64
dtypes: int64(2), object(3)
memory usage: 4.0+ KB

In [16]:
df.head()

,caldate,eventname,catgroup,priceperticket,qtysold
0,2008-11-02T00:00:00.000Z,Built To Spill,Concerts,96,291
1,2008-11-19T00:00:00.000Z,Spring Awakening,Shows,137,261
2,2008-12-12T00:00:00.000Z,All My Sons,Shows,208,249
3,2008-10-29T00:00:00.000Z,Phantom of the Opera,Shows,93,244
4,2008-04-26T00:00:00.000Z,Shakira,Concerts,193,219

In [18]:
df.columns

Index(['caldate', 'eventname', 'catgroup', 'priceperticket', 'qtysold'], dtype='object')

In [19]:
print(df.head(5).to_markdown())

|    | caldate                  | eventname            | catgroup   |   priceperticket |   qtysold |
|---:|:-------------------------|:---------------------|:-----------|-----------------:|----------:|
|  0 | 2008-11-02T00:00:00.000Z | Built To Spill       | Concerts   |               96 |       291 |
|  1 | 2008-11-19T00:00:00.000Z | Spring Awakening     | Shows      |              137 |       261 |
|  2 | 2008-12-12T00:00:00.000Z | All My Sons          | Shows      |              208 |       249 |
|  3 | 2008-10-29T00:00:00.000Z | Phantom of the Opera | Shows      |               93 |       244 |
|  4 | 2008-04-26T00:00:00.000Z | Shakira              | Concerts   |              193 |       219 |